/*
 * 文件 : dma_data.c
 * 描述 : DMA 数据收发模块实现
 * 版本 : v1.0
 * 日期 : 2026-03-23
 *
 * 修改记录（最新版本在最前）:
 *  ver  who      date       modification
 * ----- -------  ---------- ---------------------------------
 * 1.0   ---      26/03/23   创建文件
 */

#include "dma_data.h"

// ---- 私有宏定义 ----//

// ---- 私有类型定义 ----//

// ---- 私有变量 ----//

// ---- 函数实现 ----//

/**
 * @brief  模块初始化
 * @return 0 成功，-1 失败
 */
int dma_data_init(void) {
    return 0;
}

/**
 * @brief  模块轮询处理（主循环调用）
 */
void dma_data_poll(void) {

}
